//RECOLECCION DE PALABRAS


var USUARIO = "Anastasia"


  /*************************/
 /******** STRINGS ********/
/*************************/
var ASCII = [
"☺","☻","♥","♦","♣","♠","•","◘","○","◙","♂","♀","♪","♫","☼","►","◄","↕","‼","¶","§","▬","↨","↑","↓","→","←","∟","↔","▲","▼"," ","!",'"',"#","$","%","&","'","(",")","*","+",",","-",".","/","0","1","2","3","4","5","6","7","8","9",":",";","<","=",">","?","@","A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z","[","\\","]","^","_","`","a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z","{","|","}","~","⌂","Ç","ü","é","â","ä","à","å","ç","ê","ë","è","ï","î","ì","Ä","Å","É","æ","Æ","ô","ö","ò","û","ù","ÿ","Ö","Ü","ø","£","Ø","×","ƒ","á","í","ó","ú","ñ","Ñ","ª","º","¿","®","¬","½","¼","¡","«","»","░","▒","▓","│","┤","Á","Â","À","©","╣","║","╗","╝","¢","¥","┐","└","┴","┬","├","─","┼","ã","Ã","╚","╔","╩","╦","╠","═","╬","¤","ð","Ð","Ê","Ë","È","ı","Í","Î","Ï","┘","┌","█","▄","¦","Ì","▀","Ó","ß","Ô","Ò","õ","Õ","µ","þ","Þ","Ú","Û","Ù","ý","Ý","¯","´","­","±","‗","¾","‗","Å","÷","¸","°","¨","·","¹","³","²","■"," "];




//EJ reemplazar("Holx q.", {"x":"a", 'q.':'que tal?'}); -> "Hola que tal?"
function reemplazar(cadena, obj) {
    Object.keys(obj).forEach(el => {
        const reg=new RegExp(el, "gi")
        cadena=cadena.replace(reg, obj[el]);
    });
    return cadena;
}


//EJ textoSeguro("Camión.♥"); -> "Cami&#242;n." ñ
function textoSeguro(str){
	obj ={/*AMPERSAND*/'&': '&#38;','<':'&#60;','>':'&#62;',/*SIMBOLOS CORRECTOS*/'¡': '&#161;','¢': '&#162;','£': '&#163;','¤': '&#164;',"á": "&#225;",'¥': '&#165;','¦': '&#166;','§': '&#167;','¨': '&#168;','©': '&#169;','ª': '&#170;','«': '&#171;','¬': '&#172;','®': '&#174;','¯': '&#175;','°': '&#176;','±': '&#177;','²': '&#178;','³': '&#179;','´': '&#180;','µ': '&#181;','¶': '&#182;','·': '&#183;','¸': '&#184;','¹': '&#185;','º': '&#186;','»': '&#187;','¼': '&#188;','½': '&#189;','¾': '&#190;','¿': '&#191;','À': '&#192;','Á': '&#193;','Â': '&#194;','Ã': '&#195;','Ä': '&#196;','Å': '&#197;','Æ': '&#198;','Ç': '&#199;','È': '&#200;','É': '&#201;','Ê': '&#202;','Ë': '&#203;','Ì': '&#204;','Í': '&#205;','Î': '&#206;','Ï': '&#207;','Ð': '&#208;','Ñ': '&#209;','Ò': '&#210;','Ó': '&#211;','Ô': '&#212;','Õ': '&#213;','Ö': '&#214;','×': '&#215;','Ø': '&#216;','Ù': '&#217;','Ú': '&#218;','Û': '&#219;','Ü': '&#220;','Ý': '&#221;','Þ': '&#222;','ß': '&#223;','à': '&#224;','á': '&#225;','â': '&#226;','ã': '&#227;','ä': '&#228;','å': '&#229;','æ': '&#230;','ç': '&#231;','è': '&#232;','é': '&#233;','ê': '&#234;','ë': '&#235;','ì': '&#236;','í': '&#237;','î': '&#238;','ï': '&#239;','ð': '&#240;','ñ': '&#241;','ò': '&#242;','ó': '&#243;','ô': '&#244;','õ': '&#245;','ö': '&#246;','÷': '&#247;','ø': '&#248;','ù': '&#249;','ú': '&#250;','û': '&#251;','ü': '&#252;','ý': '&#253;','þ': '&#254;','ÿ': '&#255;',/*SIMBOLOS GRANDES 1*/'Œ': '&#338;','œ': '&#339;','Š': '&#352;','š': '&#353;','Ÿ': '&#376;','ƒ': '&#402;',/*SIMBOLOS GRANDES 2*/'–': '&#8211;','—': '&#8212;','‘': '&#8216;','’': '&#8217;','‚': '&#8218;','“': '&#8220;','”': '&#8221;','„': '&#8222;','†': '&#8224;','‡': '&#8225;','•': '&#8226;','…': '&#8230;','‰': '&#8240;','€': '&#8264;','™': '&#8282;',/*SIMBOLOS ERRONEOS 1*'☺':'&#1;','☻':'&#2;','♥':'&#3;','♦':'&#4;','♣': '&#5;','♠': '&#6;','•': '&#7;','◘': '&#8;','○': '&#9;','◙': '&#10;','♂': '&#11;','♀': '&#12;','♪': '&#13;','♫': '&#14;','☼': '&#15;','►': '&#16;','◄': '&#17;','↕': '&#18;','‼': '&#19;','¶': '&#20;','§': '&#21;','▬': '&#22;','↨': '&#23;','↑': '&#24;','↓': '&#25;','→': '&#26;','←': '&#27;','∟': '&#28;','↔': '&#29;','▲': '&#30;','▼': '&#31;',/*SIMBOLOS ERRONEOS 2*'⌂': '&#127;','×': '&#158;',/*BORRAR ERRONEOS 1*/'☺':'','☻':'','♥':'','♦':'','♣': '','♠': '','•': '','◘': '','○': '','◙': '','♂': '','♀': '','♪': '','♫': '','☼': '','►': '','◄': '','↕': '','‼': '','¶': '','§': '','▬': '','↨': '','↑': '','↓': '','→': '','←': '','∟': '','↔': '','▲': '','▼': '',/*BORRAR ERRONEOS 2*/'⌂': '','×': ''};
	
	return reemplazar(str, obj);
}
/* EJEMPLO PUESTO EN PRACTICA *
document.write("<br>");
for(var i=338; i<=402;i++){
	document.write(",'': '&#38;#"+i+";'");
}
document.write("<br>");
/**/

function textoSeguroInvertido(str){
	obj ={/*AMPERSAND*/'&#38;':'&','&#60;':'<','&#62;':'>',/*SIMBOLOS CORRECTOS*/'&#161;':'¡','&#162;':'¢','&#163;':'£','&#164;':'¤',"&#225;":"á",'&#165;':'¥','&#166;':'¦','&#167;':'§','&#168;':'¨','&#169;':'©','&#170;':'ª','&#171;':'«','&#172;':'¬','&#174;':'®','&#175;':'¯','&#176;':'°','&#177;':'±','&#178;':'²','&#179;':'³','&#180;':'´','&#181;':'µ','&#182;':'¶','&#183;':'·','&#184;':'¸','&#185;':'¹','&#186;':'º','&#187;':'»','&#188;':'¼','&#189;':'½','&#190;':'¾','&#191;':'¿','&#192;':'À','&#193;':'Á','&#194;':'Â','&#195;':'Ã','&#196;':'Ä','&#197;':'Å','&#198;':'Æ','&#199;':'Ç','&#200;':'È','&#201;':'É','&#202;':'Ê','&#203;':'Ë','&#204;':'Ì','&#205;':'Í','&#206;':'Î','&#207;':'Ï','&#208;':'Ð','&#209;':'Ñ','&#210;':'Ò','&#211;':'Ó','&#212;':'Ô','&#213;':'Õ','&#214;':'Ö','&#215;':'×','&#216;':'Ø','&#217;':'Ù','&#218;':'Ú','&#219;':'Û','&#220;':'Ü','&#221;':'Ý','&#222;':'Þ','&#223;':'ß','&#224;':'à','&#225;':'á','&#226;':'â','&#227;':'ã','&#228;':'ä','&#229;':'å','&#230;':'æ','&#231;':'ç','&#232;':'è','&#233;':'é','&#234;':'ê','&#235;':'ë','&#236;':'ì','&#237;':'í','&#238;':'î','&#239;':'ï','&#240;':'ð','&#241;':'ñ','&#242;':'ò','&#243;':'ó','&#244;':'ô','&#245;':'õ','&#246;':'ö','&#247;':'÷','&#248;':'ø','&#249;':'ù','&#250;':'ú','&#251;':'û','&#252;':'ü','&#253;':'ý','&#254;':'þ','&#255;':'ÿ',/*SIMBOLOS GRANDES 1*/'&#338;':'Œ','&#339;':'œ','&#352;':'Š','&#353;':'š','&#376;':'Ÿ','&#402;':'ƒ',/*SIMBOLOS GRANDES 2*/'&#8211;':'–','&#8212;':'—','&#8216;':'‘','&#8217;':'’','&#8218;':'‚','&#8220;':'“','&#8221;':'”','&#8222;':'„','&#8224;':'†','&#8225;':'‡','&#8226;':'•','&#8230;':'…','&#8240;':'‰','&#8264;':'€','&#8282;':'™',/*SIMBOLOS ERRONEOS 1*'&#1;':'☺','&#2;':'☻','&#3;':'♥','&#4;':'♦','&#5;':'♣','&#6;':'♠','&#7;':'•','&#8;':'◘','&#9;':'○','&#10;':'◙','&#11;':'♂','&#12;':'♀','&#13;':'♪','&#14;':'♫','&#15;':'☼','&#16;':'►','&#17;':'◄','&#18;':'↕','&#19;':'‼','&#20;':'¶','&#21;':'§','&#22;':'▬','&#23;':'↨','&#24;':'↑','&#25;':'↓','&#26;':'→','&#27;':'←','&#28;':'∟','&#29;':'↔','&#30;':'▲','&#31;':'▼',/*SIMBOLOS ERRONEOS 2*'&#127;':'⌂','&#158;':'×'/**/};
	
	return reemplazar(str, obj);
}



function textoSeguroInvertido(str){
	obj ={/*AMPERSAND*/'&#38;':'&',/*SIMBOLOS CORRECTOS*/'&#161;':'¡','&#162;':'¢','&#163;':'£','&#164;':'¤',"&#225;":"á",'&#165;':'¥','&#166;':'¦','&#167;':'§','&#168;':'¨','&#169;':'©','&#170;':'ª','&#171;':'«','&#172;':'¬','&#174;':'®','&#175;':'¯','&#176;':'°','&#177;':'±','&#178;':'²','&#179;':'³','&#180;':'´','&#181;':'µ','&#182;':'¶','&#183;':'·','&#184;':'¸','&#185;':'¹','&#186;':'º','&#187;':'»','&#188;':'¼','&#189;':'½','&#190;':'¾','&#191;':'¿','&#192;':'À','&#193;':'Á','&#194;':'Â','&#195;':'Ã','&#196;':'Ä','&#197;':'Å','&#198;':'Æ','&#199;':'Ç','&#200;':'È','&#201;':'É','&#202;':'Ê','&#203;':'Ë','&#204;':'Ì','&#205;':'Í','&#206;':'Î','&#207;':'Ï','&#208;':'Ð','&#209;':'Ñ','&#210;':'Ò','&#211;':'Ó','&#212;':'Ô','&#213;':'Õ','&#214;':'Ö','&#215;':'×','&#216;':'Ø','&#217;':'Ù','&#218;':'Ú','&#219;':'Û','&#220;':'Ü','&#221;':'Ý','&#222;':'Þ','&#223;':'ß','&#224;':'à','&#225;':'á','&#226;':'â','&#227;':'ã','&#228;':'ä','&#229;':'å','&#230;':'æ','&#231;':'ç','&#232;':'è','&#233;':'é','&#234;':'ê','&#235;':'ë','&#236;':'ì','&#237;':'í','&#238;':'î','&#239;':'ï','&#240;':'ð','&#241;':'ñ','&#242;':'ò','&#243;':'ó','&#244;':'ô','&#245;':'õ','&#246;':'ö','&#247;':'÷','&#248;':'ø','&#249;':'ù','&#250;':'ú','&#251;':'û','&#252;':'ü','&#253;':'ý','&#254;':'þ','&#255;':'ÿ',/*SIMBOLOS GRANDES 1*/'&#338;':'Œ','&#339;':'œ','&#352;':'Š','&#353;':'š','&#376;':'Ÿ','&#402;':'ƒ',/*SIMBOLOS GRANDES 2*/'&#8211;':'–','&#8212;':'—','&#8216;':'‘','&#8217;':'’','&#8218;':'‚','&#8220;':'“','&#8221;':'”','&#8222;':'„','&#8224;':'†','&#8225;':'‡','&#8226;':'•','&#8230;':'…','&#8240;':'‰','&#8264;':'€','&#8282;':'™',/*SIMBOLOS ERRONEOS 1*'&#1;':'☺','&#2;':'☻','&#3;':'♥','&#4;':'♦','&#5;':'♣','&#6;':'♠','&#7;':'•','&#8;':'◘','&#9;':'○','&#10;':'◙','&#11;':'♂','&#12;':'♀','&#13;':'♪','&#14;':'♫','&#15;':'☼','&#16;':'►','&#17;':'◄','&#18;':'↕','&#19;':'‼','&#20;':'¶','&#21;':'§','&#22;':'▬','&#23;':'↨','&#24;':'↑','&#25;':'↓','&#26;':'→','&#27;':'←','&#28;':'∟','&#29;':'↔','&#30;':'▲','&#31;':'▼',/*SIMBOLOS ERRONEOS 2*'&#127;':'⌂','&#158;':'×'/**/};
	
	return reemplazar(str, obj);
}


//EJ asciiAStr("A"); -> 65
function strAAscii(str){
	for(var i=0;i<=255;i++){
		if(str==ASCII[i]){
			return i+1;
		}
	}
	return 0;
}


//EJ asciiAStr(65); -> "A"
function asciiAStr(inp){
	if(inp==244 || inp==245)return "";
	if(inp>0){
		return ASCII[inp-1];
	}
	return 0;
}


//EJ arrayAStr(["H", "o", "l", "a"]); -> "Hola"
function arrayAStr(str){
	res = "";
	strL = str.length;
	for(var i = 0; i < strL; i++){
		res += str[i];
	}
	return res;
}


//EJ aMinusculas("AbcDe"); -> "abcde"
function aMinusculas(str){
	str = textoSeguro(str);
	str = Array.from(str);
	var strL = str.length, ascii;
	
	
	for(var i=0; i<strL;i++){
		ascii = strAAscii(str[i]);
		if(ascii >= 65 && ascii <= 90){
			str[i]=asciiAStr(ascii+32);
		} else if(str[i] == "&" && str[i+1] == "#" && str[i+5] == ";"){
			if(str[i+2] == "2"){
				if(str[i+3] == "0"){
					/*ñ &#241;*/ if(str[i+4] == "9"){
						str[i+3] = "4"
						str[i+4] = "1"
						i+=5;
					} /*é &#233;*/ else if(str[i+4] == "1"){
						str[i+3] = "3"
						str[i+4] = "3"
						i+=5;
					}
					/*í &#237;*/ else if(str[i+4] == "5"){
						str[i+3] = "3"
						str[i+4] = "7"
						i+=5;
					} 
				} else if(str[i+3] == "1"){
					/*ó &#243;*/ if(str[i+4] == "1"){
						str[i+3] = "4"
						str[i+4] = "3"
						i+=5;
					} /*ú &#250;*/ else if(str[i+4] == "8"){
						str[i+3] = "5"
						str[i+4] = "0"
						i+=5;
					}
				}
				
			} /*á &#225;*/ else if(str[i+2] == "1" && str[i+3] == "9" && str[i+4] == "3"){
				str[i+2] = "2"
				str[i+3] = "2"
				str[i+4] = "5"
				i+=5;
			}
		}
	}
	
	
	return arrayAStr(str);
}
//EJ document.write(aMinusculas("ABCDEFGHIJKLMNÑOPQRSTUVWXYZ ÁÉÍÓÚ"));

//EJ aMayusculas("AbcDe"); -> "ABCDE"
function aMayusculas(str){
	var str = textoSeguro(str);
	str = Array.from(str);
	var strL = str.length, ascii;
	
	
	for(var i=0; i<strL;i++){
		ascii = strAAscii(str[i]);
		if(ascii >= 97 && ascii <= 122){
			str[i]=asciiAStr(ascii-32); //'ñ': '&#241;'     'Ñ': '&#209;'
		} /*ñ &#209;*/ else if(str[i] == "&" && str[i+1] == "#" && str[i+2] == "2" && str[i+3] == "4" && str[i+4] == "1" && str[i+5] == ";"){
			str[i+3] = "0"
			str[i+4] = "9"
			str[i+5] = ";"
			i+=5;
		} /*Á &#193;*/ else if(str[i] == "&" && str[i+1] == "#" && str[i+2] == "2" && str[i+3] == "2" && str[i+4] == "5" && str[i+5] == ";"){
			str[i+2] = "1"
			str[i+3] = "9"
			str[i+4] = "3"
			str[i+5] = ";"
			i+=5;
		} /*É &#201;*/ else if(str[i] == "&" && str[i+1] == "#" && str[i+2] == "2" && str[i+3] == "3" && str[i+4] == "3" && str[i+5] == ";"){
			str[i+3] = "0"
			str[i+4] = "1"
			str[i+5] = ";"
			i+=5;
		} /*Í &#205;*/ else if(str[i] == "&" && str[i+1] == "#" && str[i+2] == "2" && str[i+3] == "3" && str[i+4] == "7" && str[i+5] == ";"){
			str[i+3] = "0"
			str[i+4] = "5"
			str[i+5] = ";"
			i+=5;
		} /*Ó &#211;*/ else if(str[i] == "&" && str[i+1] == "#" && str[i+2] == "2" && str[i+3] == "4" && str[i+4] == "3" && str[i+5] == ";"){
			str[i+3] = "1"
			str[i+4] = "1"
			str[i+5] = ";"
			i+=5;
		} /*Ú &#218;*/ else if(str[i] == "&" && str[i+1] == "#" && str[i+2] == "2" && str[i+3] == "5" && str[i+4] == "0" && str[i+5] == ";"){
			str[i+3] = "1"
			str[i+4] = "8"
			str[i+5] = ";"
			i+=5;
		}
	}
	
	
	return arrayAStr(str);
}
//EJ document.write(aMayusculas("<br>abcdefghijklmnñopqrstuvwxyz áéíóú<br>"));








//EJ buscarTxt("Hola hasd hola hola", "hola");        -> [10, 15]
//EJ buscarTxt("Hola hasd hola hola", "hola", false); -> [0, 10, 15]
function buscarTxt(str, encontrar, sensible = true){
	var __RAM_s=new Array();
	__RAM_s = Array.from(str);
	var encontrar = Array.from(encontrar);
	var tStr = __RAM_s.length;
	var tEncontrar = encontrar.length;
	
	var pos = new Array();
	pos[0] = -1;
	var _pos = 0;
	
	var coin = 0; //coincidencias encontradas
	
	
	if(sensible){
		for(i = 0; i <= (tStr - 1); i++){
			if(__RAM_s[i] == encontrar[coin]){
				coin++;
			} else {
				coin = 0;
			}
			if(coin == tEncontrar){
				pos[_pos] = i - (tEncontrar - 1);
				coin = 0;
				_pos++;
			}
		}
	} else {
		for(i = 0; i <= (tStr - 1); i++){
			if(aMinusculas(__RAM_s[i]) == aMinusculas(encontrar[coin])){
				coin++;
			} else {
				coin = 0;
			}
			if(coin == tEncontrar){
				pos[_pos] = i - (tEncontrar - 1);
				coin = 0;
				_pos++;
			}
		}
	}
	return pos;
}
/* EJEMPLO PUESTO EN PRACTICA *
	var txt="Hola hasd hola hola";
	document.write("Frase: "+txt+"<br>Se encontro en ");
	var res = buscarTxt(txt, "hola", false);
	
	document.write("["+res+"]");
/**/

















  /************************************/
 /******** HERRAMIENTAS RUSAS ********/
/************************************/
var ABC_RU = ['А', 'а', 'Б', 'б', 'В', 'в', 'Г', 'г', 'Д', 'д', 'Е', 'е', 'Ё', 'ё', 'Ж', 'ж', 'З', 'з', 'И', 'и', 'Й', 'й', 'К', 'к', 'Л', 'л', 'М', 'м', 'Н', 'н', 'О', 'о', 'П', 'п', 'Р', 'р', 'С', 'с', 'Т', 'т', 'У', 'у', 'Ф', 'ф', 'Х', 'х', 'Ц', 'ц', 'Ч', 'ч', 'Ш', 'ш', 'Щ', 'щ', 'Ъ', 'ъ', 'Ы', 'ы', 'Ь', 'ь', 'Э', 'э', 'Ю', 'ю', 'Я', 'я'];

ABC_RU_MIN = {'А': 'а', 'Б': 'б', 'В': 'в', 'Г': 'г', 'Д': 'д', 'Е': 'е', 'Ё': 'ё', 'Ж': 'ж', 'З': 'з', 'И': 'и', 'Й': 'й', 'К': 'к', 'Л': 'л', 'М': 'м', 'Н': 'н', 'О': 'о', 'П': 'п', 'Р': 'р', 'С': 'с', 'Т': 'т', 'У': 'у', 'Ф': 'ф', 'Х': 'х', 'Ц': 'ц', 'Ч': 'ч', 'Ш': 'ш', 'Щ': 'щ', 'Ъ': 'ъ', 'Ы': 'ы', 'Ь': 'ь', 'Э': 'э', 'Ю': 'ю', 'Я': 'я'};

ABC_RU_MAY = {'а': 'А', 'б': 'Б', 'в': 'В', 'г': 'Г', 'д': 'Д', 'е': 'Е', 'ё': 'Ё', 'ж': 'Ж', 'з': 'З', 'и': 'И', 'й': 'Й', 'к': 'К', 'л': 'Л', 'м': 'М', 'н': 'Н', 'о': 'О', 'п': 'П', 'р': 'Р', 'с': 'С', 'т': 'Т', 'у': 'У', 'ф': 'Ф', 'х': 'Х', 'ц': 'Ц', 'ч': 'Ч', 'ш': 'Ш', 'щ': 'Щ', 'ъ': 'Ъ', 'ы': 'Ы', 'ь': 'Ь', 'э': 'Э', 'ю': 'Ю', 'я': 'Я'};


  /***********************************/
 /******** ETAPA DE BUSQUEDA ********/
/***********************************/
//INPUTS
var boxMsg="im-mess--text wall_module _im_log_body";

var mencionados=document.getElementsByClassName("im-replied _im_replied_message");
var mencionadosL=mencionados.length-1;
var msgL=document.getElementsByClassName("im-mess-stack--lnk").length;
var msg, borrar, _msgL;

var recoleccion=Array(), recoleccionL=1, contador=Array(), puntero=0, encontrado;

var flujo;

//PROCESAMIENTO
for(var iA=0;iA<msgL;iA++){
	flujo=true;
	//ELIMINACION DE TEXTO INNECESARIO
	msg = document.getElementsByClassName(boxMsg)[iA].textContent;
	borrar = mencionados[mencionadosL].textContent;
	if(buscarTxt(msg, "im-replied _im_replied_message") > -1){
		msg.replace(borrar, "");
		msg.replace("Giovanni-Sj Scellato", "");
		mencionadosL--;
		flujo=false;
	}
	
	if(flujo && document.getElementsByClassName("im-mess-stack--lnk")[iA].textContent == "Anastasia"){
		//objAB = {"." : " ", "," : " ", '"' : " ", "«" : " ", "»" : " ", "¿" : " ", "!" : " ", "     ": " ", "    ": " ", "   ": " ", "  ": " "};
		//msg=reemplazar(msg, objAB);
		msg=msg.replaceAll(".", " ");
		msg=msg.replaceAll(",", " ");
		msg=msg.replaceAll('"', " ");
		msg=msg.replaceAll("«", " ");
		msg=msg.replaceAll("»", " ");
		msg=msg.replaceAll("¿", " ");
		msg=msg.replaceAll("?", " ");
		msg=msg.replaceAll("!", " ");
		msg=msg.replaceAll("     ", " ");
		msg=msg.replaceAll("    ", " ");
		msg=msg.replaceAll("   ", " ");
		msg=msg.replaceAll("  ", " ");
		
		
		msg=msg.replaceAll("?", " ");
		msg=msg.replaceAll(")", "");
		msg=msg.replaceAll("(", "");
		
		//DE MAYUSCULAS A MINUSCULAS
		msg=reemplazar(msg, ABC_RU_MIN);
		msg=aMinusculas(msg);
		
		//ANALICIS POR DESINTEGRACION
		var _msg=msg.split(" ");
		_msgL=msg.length;
		
		
		for(var iB=0;iB<_msgL;iB++){
			encontrado=false;
			for(var iC=0;iC<recoleccionL;iC++){
				if(_msg[iB]==recoleccion[iC]){
					encontrado=true;
					puntero=iC;
					iC=recoleccionL;
				}
				
			}
			if(encontrado){
				contador[puntero]++;
			} else {
				recoleccion[recoleccionL]=_msg[iB];
				contador[recoleccionL]=1;
				recoleccionL++;
			}
			
		}
	}
	
}
console.log("LISTO")





  /**********************************/
 /******** EJEMPLO PRACTICO ********/
/**********************************/
var n = 30;

var _excepto=Array();
var _exceptoL;
function hay(inp, modo=false){
    _exceptoL=_excepto.length;
    if(!modo){
        var flujo=false;
        for(var i=0;i<_exceptoL;i++){
            if(_excepto[i]==inp){ flujo=true; i=_exceptoL; }
        }
        return flujo;
    } else {
        _excepto[_exceptoL]=inp;
    }
}
var pasado=0, mayor=0, res="";
for(var iA=0;iA<n;iA++){
    pasado=0;
    for(var i=0;i<recoleccionL;i++){
        if(!hay(i) && pasado<contador[i]){ pasado=contador[i]; mayor=i;  }
    }
    if(mayor){
        hay(mayor, true);
		res+=recoleccion[mayor]+': '+contador[mayor]+'\n';
        mayor=0
    }
}

console.log(res);
